I am not able to reproduce the problem with a simplified test case below using Terraform 1.6.6 and AWS Provider 5.31.0. The other possible cause is that you have the resource group created outside of Terraform in your account in us-east-1. I would recommend double checking that in AWS Management Console.

```tf
resource "aws_resourcegroups_group" "resource-group" {
	name = "idh-global-p-cpl-resourcegroup"
	resource_query {
		type = "TAG_FILTERS_1_0"
		query = jsonencode({
			"ResourceTypeFilters": [
				"AWS::AllSupported"
			],
			"TagFilters": [
				{
					"Key": "idhub-resource"
				}
			]
		})
	}
}

resource "aws_resourcegroups_group" "resource-group-global" {
	name = "idh-global-p-cpl-resourcegroup_global"
	resource_query {
		type = "TAG_FILTERS_1_0"
		query = jsonencode({
			"ResourceTypeFilters": [
				"AWS::AllSupported"
			],
			"TagFilters": [
				{
					"Key": "idhub-resource"
				}
			]
		})
	}
}
```

```tf
C:\working\test>terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_resourcegroups_group.resource-group will be created
  + resource "aws_resourcegroups_group" "resource-group" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "idh-global-p-cpl-resourcegroup"
      + tags_all = (known after apply)

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key = "idhub-resource"
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

  # aws_resourcegroups_group.resource-group-global will be created
  + resource "aws_resourcegroups_group" "resource-group-global" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "idh-global-p-cpl-resourcegroup_global"
      + tags_all = (known after apply)

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key = "idhub-resource"
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_resourcegroups_group.resource-group: Creating...
aws_resourcegroups_group.resource-group-global: Creating...
aws_resourcegroups_group.resource-group-global: Creation complete after 1s [id=idh-global-p-cpl-resourcegroup_global]
aws_resourcegroups_group.resource-group: Creation complete after 1s [id=idh-global-p-cpl-resourcegroup]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```